app/controllers/tracks_controller.rb

def index
	@track = Track.new
	@tracks = Track.where(user_id: @user_id)
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."user_id" = '8e663005fbf56779f44308e1ac936d26'

def create
	if is_url(params[:track][:query])
		@trackinfo = getTrackInfo(params[:track][:query])
	else
		@trackinfo = youTubeQuery(params[:track][:query])

	end

	@track = Track.new(@trackinfo)
	@track.user_id = @user_id
	@tracks = Track.where(user_id: @user_id)
	@video_ids = Track.pluck(:video_id)

	if @track.save
---
SELECT "tracks"."video_id" FROM "tracks"
INSERT INTO "tracks" ("created_at", "thumbnail_url", "title", "updated_at", "user_id", "video_id") VALUES (?, ?, ?, ?, ?, ?)

def destroy
	@track = Track.find(params[:id])
	@track.destroy
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 4]]

def retrieve
	Hirb.enable
	print Track.limit(100)
	puts "in this action"
	@tracklist = Track.where(user_id: @user_id).pluck(:video_id)
	@tracknames = Track.where(user_id: @user_id).pluck(:title)
---
SELECT "tracks"."video_id" FROM "tracks" WHERE "tracks"."user_id" = 'ffc3357cfeafef3df1996b8c9f1b4437'
SELECT "tracks"."title" FROM "tracks" WHERE "tracks"."user_id" = 'ffc3357cfeafef3df1996b8c9f1b4437'